; domain
(define (domain spanner)                    
(:requirements :typing :strips :constraints)      

(:types 
	location locatable - object
	man nut spanner - locatable	
)                                           
                                                                               
(:predicates 
	(at ?m - locatable ?l - location)
	(carrying ?m - man ?s - spanner)
	(useable ?s - spanner)
	(link ?l1 - location ?l2 - location)
	(tightened ?n - nut)
	(loose ?n - nut))                                                                                           
(:action walk 
        :parameters (?start - location ?end - location ?m - man)
        :precondition (and (at ?m ?start) 
                           (link ?start ?end))                                                          
        :effect (and (not (at ?m ?start)) (at ?m ?end)))

(:action pickup_spanner 
        :parameters (?l - location ?s - spanner ?m - man)
        :precondition (and (at ?m ?l) 
                           (at ?s ?l))
        :effect (and (not (at ?s ?l))
                     (carrying ?m ?s)))

(:action tighten_nut 
        :parameters (?l - location ?s - spanner ?m - man ?n - nut)
        :precondition (and (at ?m ?l) 
		      	   (at ?n ?l)
			   (carrying ?m ?s)
			   (useable ?s)
			   (loose ?n))
        :effect (and (not (loose ?n))(not (useable ?s)) (tightened ?n)))
)

; problem
; params: python3 spanner-generator.py 3 3 8 --seed 727147 --problem-name prob_s3_n3_l8_s727147
(define (problem prob_s3_n3_l8_s727147)
 (:domain spanner)
 (:objects 
     bob - man
     spanner1 spanner2 spanner3 - spanner
     nut1 nut2 nut3 - nut
     location1 location2 location3 location4 location5 location6 location7 location8 - location
     shed gate - location
    )
 (:init 
    (at bob shed)
    (at spanner1 location6)
    (useable spanner1)
    (at spanner2 location2)
    (useable spanner2)
    (at spanner3 location2)
    (useable spanner3)
    (loose nut1)
    (at nut1 gate)
    (loose nut2)
    (at nut2 gate)
    (loose nut3)
    (at nut3 gate)
    (link shed location1)
    (link location8 gate)
    (link location1 location2)
    (link location2 location3)
    (link location3 location4)
    (link location4 location5)
    (link location5 location6)
    (link location6 location7)
    (link location7 location8)
)
 (:goal
  (and
   (tightened nut1)
   (tightened nut2)
   (tightened nut3)
)))

; plan
1. (walk shed location1 bob)
   deleted: (at bob shed)
   added: (at bob location1)
   goals met: 0 of 3
2. (walk location1 location2 bob)
   deleted: (at bob location1)
   added: (at bob location2)
   goals met: 0 of 3
3. (pickup_spanner location2 spanner2 bob)
   deleted: (at spanner2 location2)
   added: (carrying bob spanner2)
   goals met: 0 of 3
4. (pickup_spanner location2 spanner3 bob)
   deleted: (at spanner3 location2)
   added: (carrying bob spanner3)
   goals met: 0 of 3
5. (walk location2 location3 bob)
   deleted: (at bob location2)
   added: (at bob location3)
   goals met: 0 of 3
6. (walk location3 location4 bob)
   deleted: (at bob location3)
   added: (at bob location4)
   goals met: 0 of 3
7. (walk location4 location5 bob)
   deleted: (at bob location4)
   added: (at bob location5)
   goals met: 0 of 3
8. (walk location5 location6 bob)
   deleted: (at bob location5)
   added: (at bob location6)
   goals met: 0 of 3
9. (pickup_spanner location6 spanner1 bob)
   deleted: (at spanner1 location6)
   added: (carrying bob spanner1)
   goals met: 0 of 3
10. (walk location6 location7 bob)
   deleted: (at bob location6)
   added: (at bob location7)
   goals met: 0 of 3
11. (walk location7 location8 bob)
   deleted: (at bob location7)
   added: (at bob location8)
   goals met: 0 of 3
12. (walk location8 gate bob)
   deleted: (at bob location8)
   added: (at bob gate)
   goals met: 0 of 3
13. (tighten_nut gate spanner1 bob nut3)
   deleted: (loose nut3) (useable spanner1)
   added: (tightened nut3)
   goals met: 1 of 3
14. (tighten_nut gate spanner2 bob nut2)
   deleted: (loose nut2) (useable spanner2)
   added: (tightened nut2)
   goals met: 2 of 3
15. (tighten_nut gate spanner3 bob nut1)
   deleted: (loose nut1) (useable spanner3)
   added: (tightened nut1)
   goals met: 3 of 3
